winkelict/promini2_cs/mighycore_pinout/pins_arduino.h
/***************************************************|
|            MIGHTYCORE STANDARD PINOUT             |
|       https://github.com/MCUdude/MightyCore       |
|                                                   |
| An Arduino core for:                              |
| ATmega1284/P                                      |
| ATmega644/A/P/PA                                  |
| ATmega324A/P/PA/PB                                |
| ATmega164A/P/PA                                   |
| ATmega32/A                                        |
| ATmega16/A                                        |
| ATmega8535                                        |
|                                                   |
|***************************************************/

#ifndef Pins_Arduino_h
#define Pins_Arduino_h

#include <avr/pgmspace.h>

//NOTES: everything thats not atmega644 is standard pinout incl atmega 1284
//KLAAS: TEMP REMOVE
///#define __AVR_ATmega644A__
//#define ARDUINO_MAIN

#if defined(__AVR_ATmega644A__)
  #define __AVR_ATmega644__
#endif

#define MIGHTYCORE
#define MCUDUDE_MIGHTYCORE

// We're using the pro mini 2 pinout
#define PROMINI2_PINOUT

// Digital pins
#if defined(__AVR_ATmega324PB__)
  #define NUM_DIGITAL_PINS          (39)
#else
//TODO: ex JTAG, incl a6/a7
  #define NUM_DIGITAL_PINS          (22)
#endif

// PWM pins
#if defined(__AVR_ATmega8535__) || defined(__AVR_ATmega16__) || defined(__AVR_ATmega32__)
  #define digitalPinHasPWM(p)       ((p) == 3 || (p) == 12 || (p) == 13 || (p) == 15)
#elif defined(__AVR_ATmega164A__) || defined(__AVR_ATmega164P__) || defined(__AVR_ATmega324A__) || \
defined(__AVR_ATmega324P__) || defined(__AVR_ATmega324PA__) || defined(__AVR_ATmega644A__) || defined(__AVR_ATmega644P__)
  #define digitalPinHasPWM(p)       ((p) >= 7 && (p) <= 10)
#elif defined(__AVR_ATmega324PB__)
  #define digitalPinHasPWM(p)       ((p) == 3 || (p) == 4 || (p) == 6 || (p) == 7 || (p) == 12 || (p) == 13 || (p) == 14 || (p) == 15  || (p) == 20)
#elif defined(__AVR_ATmega1284__) || defined(__AVR_ATmega1284P__)
  #define digitalPinHasPWM(p)       ((p) == 3 || (p) == 4 || (p) == 6 || (p) == 7 || (p) == 12 || (p) == 13 || (p) == 14 || (p) == 15)
#endif

// Builtin LED
#define LED_BUILTIN   (13)
static const uint8_t LED = LED_BUILTIN;

// Analog pins
#define PIN_A0 (14)
#define PIN_A1 (15)
#define PIN_A2 (16)
#define PIN_A3 (17)
#define PIN_A4 (18)
#define PIN_A5 (19)
#define PIN_A6 (30) //same as standard pinout
#define PIN_A7 (31) //same as standard pinout
static const uint8_t A0 = PIN_A0;
static const uint8_t A1 = PIN_A1;
static const uint8_t A2 = PIN_A2;
static const uint8_t A3 = PIN_A3;
static const uint8_t A4 = PIN_A4;
static const uint8_t A5 = PIN_A5;
static const uint8_t A6 = PIN_A6;
static const uint8_t A7 = PIN_A7;
#define NUM_ANALOG_INPUTS           (8)

//TODO
#define analogInputToDigitalPin(p)  ((p) <= 5 ? (p) + 14 : (p) <= 7 ? (p) + 24 : -1)
#define analogPinToChannel(p)       ((p) < NUM_ANALOG_INPUTS ? (p) : (p) >=30 ? (p)-24 : (p) >= 14 ? (p) - 14 : -1)

// SPI
#define PIN_SPI_SS    (10)
#define PIN_SPI_MOSI  (11)
#define PIN_SPI_MISO  (12)
#define PIN_SPI_SCK   (13)
static const uint8_t SS   = PIN_SPI_SS;
static const uint8_t MOSI = PIN_SPI_MOSI;
static const uint8_t MISO = PIN_SPI_MISO;
static const uint8_t SCK  = PIN_SPI_SCK;
#if defined(__AVR_ATmega324PB__)
  #define PIN_SPI_SS0   PIN_SPI_SS
  #define PIN_SPI_MOSI0 PIN_SPI_MOSI
  #define PIN_SPI_MISO0 PIN_SPI_MISO
  #define PIN_SPI_SCK0  PIN_SPI_SCK
  #define PIN_SPI_SS1   (14)
  #define PIN_SPI_MOSI1 (35)
  #define PIN_SPI_MISO1 (34)
  #define PIN_SPI_SCK1  (15)
  static const uint8_t SS0   = PIN_SPI_SS0;
  static const uint8_t MOSI0 = PIN_SPI_MOSI0;
  static const uint8_t MISO0 = PIN_SPI_MISO0;
  static const uint8_t SCK0  = PIN_SPI_SCK0;
  static const uint8_t SS1   = PIN_SPI_SS1;
  static const uint8_t MOSI1 = PIN_SPI_MOSI1;
  static const uint8_t MISO1 = PIN_SPI_MISO1;
  static const uint8_t SCK1  = PIN_SPI_SCK1;
#endif

// i2c
#define PIN_WIRE_SDA  (18)
#define PIN_WIRE_SCL  (19)
static const uint8_t SDA = PIN_WIRE_SDA;
static const uint8_t SCL = PIN_WIRE_SCL;
#if defined(__AVR_ATmega324PB__)
  #define WIRE_INTERFACES_COUNT (2)
  #define PIN_WIRE_SDA0 PIN_WIRE_SDA
  #define PIN_WIRE_SCL0 PIN_WIRE_SCL
  #define PIN_WIRE_SDA1 (37)
  #define PIN_WIRE_SCL1 (38)
  static const uint8_t SDA0  = PIN_WIRE_SDA0;
  static const uint8_t SCL0  = PIN_WIRE_SCL0;
  static const uint8_t SDA1  = PIN_WIRE_SDA1;
  static const uint8_t SCL1  = PIN_WIRE_SCL1;
#endif

// Interrupts
#define EXTERNAL_NUM_INTERRUPTS     (3)
#define digitalPinToInterrupt(p)    ((p) == 2 ? 0 : ((p) == 3 ? 1 : ((p) == 6 ? 2 : NOT_AN_INTERRUPT)))

// PCINT
  /**/

#if defined(__AVR_ATmega164A__) || defined(__AVR_ATmega164P__) || defined(__AVR_ATmega324A__) || \
defined(__AVR_ATmega324P__) || defined(__AVR_ATmega324PA__) || defined(__AVR_ATmega324PB__) || \
defined(__AVR_ATmega644A__) || defined(__AVR_ATmega644P__) || defined(__AVR_ATmega1284__) || \
defined(__AVR_ATmega1284P__)
#if defined(__AVR_ATmega324PB__)
  #define digitalPinToPCMSK(p)  ((p) <= 7 ? &PCMSK1 : (p) <= 15 ? &PCMSK3 : (p) <= 23 ? &PCMSK2 : (p) <= 31 ? &PCMSK0 : &PCMSK4)
#else
  #define digitalPinToPCMSK(p)  (((p) >= 0 && (p) <= 3) || (p) == 8 || (p)==9 ? &PCMSK3 : (p) >= 4 && (p) <= 13 && (p) != 8 && (p) !=9 ? &PCMSK1 : (p) >= 14 && (p) <= 17 ? &PCMSK0 : &PCMSK2)
#endif
//attention: will return 0 for unmapped pin
#define digitalPinToPCMSKbit(p) ((p) == 0 ? 0 : (p) == 1 ? 1 : (p) == 2 ? 2 : (p) == 3 ? 3 : (p) == 4 ? 0 : (p) == 5 ? 1 : (p) == 6 ? 2 : (p) == 7 ? 3 : (p) == 8 ? 6 : (p) == 9 ? 7 : (p) == 10 ? 4 : (p) == 11 ? 5 : (p) == 12 ? 6 : (p) == 13 ? 7 : (p) == 14 ? 0 : (p) == 15 ? 1 : (p) == 16 ? 2 : (p) == 17 ? 3 : (p) == 18 ? 1 : (p) == 19 ? 0 : (p) == 20 ? 2 : (p) == 21 ? 3 : (p) == 22 ? 4 : (p) == 23 ? 5 : 0)

//same as standard pinout
#define digitalPinToPCICR(p)    (((p) >= 0 && (p) < NUM_DIGITAL_PINS) ? (&PCICR) : ((uint8_t *)0))

#define digitalPinToPCICRbit(p) ( ((p) >= 0 && (p) <= 3) || (p) == 8 || (p)==9 ? 3 : (p) >= 4 && (p) <= 13 && (p) != 8 && (p) !=9 ? 1 : (p) >= 14 && (p) <= 17 ? 0 : 2)

#endif


#define PIN_PD0 0
#define PIN_PD1 1
#define PIN_PD2 2
#define PIN_PD3 3
#define PIN_PB0 4
#define PIN_PB1 5
#define PIN_PB2 6
#define PIN_PB3 7
#define PIN_PD6 8
#define PIN_PD7 9
#define PIN_PB4 10
#define PIN_PB5 11
#define PIN_PB6 12
#define PIN_PB7 13
#define PIN_PA0 14
#define PIN_PA1 15
#define PIN_PA2 16
#define PIN_PA3 17
#define PIN_PC1 18
#define PIN_PC0 19
#define PIN_PC2 20
#define PIN_PC3 21
#define PIN_PC4 22
#define PIN_PC5 23
#define PIN_PC6 24
#define PIN_PC7 25
#define PIN_PD4 26
#define PIN_PD5 27
#define PIN_PA4 28
#define PIN_PA5 29
#define PIN_PA6 30
#define PIN_PA7 31

#if defined(__AVR_ATmega324PB__)
  #define PIN_PE0 32
  #define PIN_PE1 33
  #define PIN_PE2 34
  #define PIN_PE3 35
  #define PIN_PE4 36
  #define PIN_PE5 37
  #define PIN_PE6 38
#endif

#ifdef ARDUINO_MAIN

#define PA 1
#define PB 2
#define PC 3
#define PD 4
#if defined(__AVR_ATmega324PB__)
  #define PE 5
#endif

